historic/Samsung_NVMe_950Pro_256GB/mixed-306-1to4k_160Mseq.fio.out
randread-1k-4k: (g=0): rw=randread, bs=1K-4K/1K-4K/1K-4K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.2.8
Starting 3 processes

randread-1k-4k: (groupid=0, jobs=1): err= 0: pid=12219: Wed Apr  6 20:07:03 2016
  read : io=6536.8MB, bw=111559KB/s, iops=71870, runt= 60001msec
    slat (usec): min=1, max=27, avg= 1.98, stdev= 0.74
    clat (usec): min=14, max=11220, avg=136.57, stdev=272.55
     lat (usec): min=16, max=11223, avg=138.61, stdev=272.58
    clat percentiles (usec):
     |  1.00th=[   52],  5.00th=[   55], 10.00th=[   57], 20.00th=[   62],
     | 30.00th=[   67], 40.00th=[   71], 50.00th=[   75], 60.00th=[   82],
     | 70.00th=[   96], 80.00th=[  115], 90.00th=[  167], 95.00th=[  524],
     | 99.00th=[ 1240], 99.50th=[ 1384], 99.90th=[ 4320], 99.95th=[ 5216],
     | 99.99th=[ 6240]
    bw (KB  /s): min=85866, max=134420, per=40.56%, avg=111726.20, stdev=10339.54
    lat (usec) : 20=0.01%, 50=0.05%, 100=72.22%, 250=20.77%, 500=1.83%
    lat (usec) : 750=1.84%, 1000=1.78%
    lat (msec) : 2=1.32%, 4=0.08%, 10=0.12%, 20=0.01%
  cpu          : usr=10.07%, sys=17.02%, ctx=2496780, majf=0, minf=46
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4312305/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqread: (groupid=0, jobs=1): err= 0: pid=12220: Wed Apr  6 20:07:03 2016
  read : io=9604.0MB, bw=163897KB/s, iops=160, runt= 60004msec
    slat (usec): min=36, max=264, avg=79.36, stdev=13.86
    clat (usec): min=600, max=11283, avg=1009.51, stdev=734.73
     lat (usec): min=670, max=11359, avg=1089.03, stdev=733.46
    clat percentiles (usec):
     |  1.00th=[  644],  5.00th=[  684], 10.00th=[  700], 20.00th=[  732],
     | 30.00th=[  788], 40.00th=[  852], 50.00th=[  876], 60.00th=[  908],
     | 70.00th=[  916], 80.00th=[  940], 90.00th=[ 1020], 95.00th=[ 2192],
     | 99.00th=[ 4192], 99.50th=[ 5088], 99.90th=[10304], 99.95th=[11072],
     | 99.99th=[11328]
    bw (KB  /s): min=162217, max=167600, per=59.54%, avg=164014.84, stdev=685.03
    lat (usec) : 750=23.71%, 1000=65.58%
    lat (msec) : 2=4.96%, 4=4.53%, 10=1.09%, 20=0.14%
  cpu          : usr=0.16%, sys=1.32%, ctx=19144, majf=0, minf=552
  IO depths    : 1=99.1%, 2=0.2%, 4=0.4%, 8=0.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=9604/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqwrite: (groupid=0, jobs=1): err= 0: pid=12221: Wed Apr  6 20:07:03 2016
  write: io=9604.0MB, bw=163903KB/s, iops=160, runt= 60002msec
    slat (usec): min=34, max=153, avg=77.43, stdev=26.46
    clat (usec): min=328, max=9993, avg=434.35, stdev=435.69
     lat (usec): min=383, max=10039, avg=511.96, stdev=434.08
    clat percentiles (usec):
     |  1.00th=[  342],  5.00th=[  342], 10.00th=[  346], 20.00th=[  346],
     | 30.00th=[  350], 40.00th=[  350], 50.00th=[  354], 60.00th=[  358],
     | 70.00th=[  358], 80.00th=[  366], 90.00th=[  394], 95.00th=[  588],
     | 99.00th=[ 2512], 99.50th=[ 3440], 99.90th=[ 5216], 99.95th=[ 5600],
     | 99.99th=[10048]
    bw (KB  /s): min=160827, max=167936, per=100.00%, avg=163976.41, stdev=733.95
    lat (usec) : 500=93.98%, 750=1.85%, 1000=0.55%
    lat (msec) : 2=2.01%, 4=1.26%, 10=0.34%
  cpu          : usr=0.35%, sys=1.07%, ctx=19818, majf=0, minf=32
  IO depths    : 1=99.4%, 2=0.1%, 4=0.2%, 8=0.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=9604/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: io=16141MB, aggrb=275450KB/s, minb=111558KB/s, maxb=163897KB/s, mint=60001msec, maxt=60004msec
  WRITE: io=9604.0MB, aggrb=163902KB/s, minb=163902KB/s, maxb=163902KB/s, mint=60002msec, maxt=60002msec

Disk stats (read/write):
    dm-2: ios=4382024/76708, merge=0/0, ticks=641361/23328, in_queue=665183, util=99.87%, aggrios=4389137/76863, aggrmerge=0/0, aggrticks=641823/23339, aggrin_queue=665153, aggrutil=99.83%
  nvme0n1: ios=4389137/76863, merge=0/0, ticks=641823/23339, in_queue=665153, util=99.83%